---
kind: type
id: T:Autodesk.Revit.Creation.Application
source: html/5e11e5bf-82da-ae9b-1c52-95d0e9f28c96.htm
---
# Autodesk.Revit.Creation.Application

The Application Creation object is used to create new instances of utility objects.

## Syntax (C#)
```csharp
public class Application : APIObject
```

## Remarks
General purpose objects can be generated by this creation object. Creating objects
via this object ensures that they will be correctly constructed and will reside in the
Autodesk Revit memory space.